# -*- coding: utf-8 -*-

клас инфо:
    ъ = 34
    @classmethod
    деф главна( аз):
        print( аз.име_от_превод( 'аааа.bg'))
    @classmethod
    деф име_от_превод( кл, *имена ):
        return имена

ако __name__ == '__main__':

    клас филминфо( инфо):
        @classmethod
        деф име_от_превод( кл, име ):
            имена = [ име ]
            ако   име.endswith('.bg'): имена.append( име[:-3])
            инако име.endswith('.ru'): имена.append( име[:-3])
            иначе:
                имена.append( име+'.bg')
                имена.append( име+'.ru')
            върни инфо.име_от_превод( *имена)

        деф самопопълва_етикети( аз):
            ако аз.етикетер.звук: върни
            автор = аз.етикетер.автор
            ако не автор: върни
            р = автор.lower() във аз._заместители_по_стойност.звук
            ако р: аз.слага_етикет( аз.стойности.звук, автор)
            #иначе:
            #    р = аз.етикетер.автор във ' '.join( аз.автори_ан).split()
            #    ако р: аз.слага_етикет( аз.стойности.звук, аз.стойности.ан)
            върни р

    филминфо.главна()

# vim:ts=4:sw=4:expandtab
